{
    "ibuprofen":{
        "other_names":"Advil , Motrin",
        "use":"Ibuprofen is used to relieve pain from various conditions such as headache, dental pain, menstrual cramps, muscle aches, or arthritis. It is also used to reduce fever and to relieve minor aches and pain due to the common cold or flu.",
        "side_effects":"Upset stomach, nausea, vomiting, headache, diarrhea, constipation, dizziness, or drowsiness",
        "warnings":"Kidney problems can sometimes occur with the use of NSAID medications, including ibuprofen. This drug may make you dizzy or drowsy. This medicine may cause stomach bleeding."
    },
    "adderall":{
        "other_names":"DEXTROAMPHETAMINE-AMPHETAMINE",
        "use": "This combination medication is used to treat attention deficit hyperactivity disorder - ADHD. It works by changing the amounts of certain natural substances in the brain.",
        "side_effects":"Loss of appetite, weight loss, dry mouth, stomach upset/pain, nausea/vomiting, dizziness, headache, diarrhea, fever, nervousness, and trouble sleeping may occur.",
        "warnings":"This drug may make you dizzy. Children may be more sensitive to the side effects of this drug, especially weight loss. This medication may slow down a child's growth. "
    },
    "benadryl":{
        "other_names":"DIPHENHYDRAMINE HCL",
        "use": "Diphenhydramine is an antihistamine used to relieve symptoms of allergy, hay fever, and the common cold. These symptoms include rash, itching, watery eyes, itchy eyes/nose/throat, cough, runny nose, and sneezing. It is also used to prevent and treat nausea, vomiting and dizziness caused by motion sickness. Diphenhydramine can also be used to help you relax and fall asleep.",
        "side_effects":"Drowsiness, dizziness, constipation, stomach upset, blurred vision, or dry mouth/nose/throat may occur.",
        "warnings":"This drug may make you dizzy or drowsy or blur your vision. "
    },
    "prozac":{
        "other_names":"FLUOXETINE",
        "use": "Fluoxetine is used to treat depression, panic attacks, obsessive compulsive disorder, a certain eating disorder (bulimia), and a severe form of premenstrual syndrome (premenstrual dysphoric disorder).",
        "side_effects":"Nausea, drowsiness, dizziness, anxiety, trouble sleeping, loss of appetite, tiredness, sweating, or yawning may occur.",
        "warnings":"This drug may make you dizzy or drowsy. The liquid form of this medication contains alcohol. Caution is advised if you have diabetes, alcohol dependence, or liver disease."
    },
    "acetaminophen":{
        "other_names":"PANADOL , TYLENOL",
        "use": "This drug is used to treat mild to moderate pain (from headaches, menstrual periods, toothaches, backaches, osteoarthritis, or cold/flu aches and pains) and to reduce fever.",
        "side_effects":"This drug usually has no side effects. A very serious allergic reaction to this drug is rare.",
        "warnings":"Acetaminophen passes into breast milk. Consult your doctor before breast-feeding."
    },
    "loratadine":{
        "other_names":"Claritin",
        "use": "This medication is an antihistamine that treats symptoms such as itching, runny nose, watery eyes, and sneezing from hay fever and other allergies. It is also used to relieve itching from hives.",
        "side_effects":"This drug usually has no side effects. A very serious allergic reaction to this drug is rare. Loratadine may, but does not usually cause drowsiness when used at recommended doses.",
        "warnings":"If you have hives and your doctor has prescribed loratadine, or if you are considering using this drug to treat your own hives, tell your doctor right away if you have any of these other symptoms because they may be signs of a more serious condition: hives that are an unusual color, hives that look bruised or blistered, hives that do not itch."
    },
    "fexofenadine":{
        "other_names":"ALLEGRA",
        "use": "Fexofenadine is an antihistamine used to relieve allergy symptoms such as watery eyes, runny nose, itching eyes/nose, sneezing, hives, and itching. It works by blocking a certain natural substance (histamine) that your body makes during an allergic reaction.",
        "side_effects":"Cough, fever, or stomach upset may occur. If any of these effects last or get worse, tell your doctor or pharmacist promptly. A very serious allergic reaction to this drug is rare.",
        "warnings":""
    },
    "cetirizine":{
        "other_names":"ZYRTEC",
        "use": "Cetirizine is an antihistamine used to relieve allergy symptoms such as watery eyes, runny nose, itching eyes/nose, sneezing, hives, and itching. It works by blocking a certain natural substance (histamine) that your body makes during an allergic reaction.Cetirizine does not prevent hives or prevent/treat a serious allergic reaction (such as anaphylaxis).",
        "side_effects":"Drowsiness, tiredness, and dry mouth may occur. Stomach pain may also occur, especially in children. Tell your doctor right away if you have any serious side effects, including: difficulty urinating, weakness. A very serious allergic reaction to this drug is rare. However, get medical help right away if you notice any symptoms of a serious allergic reaction, including: rash, itching/swelling (especially of the face/tongue/throat), severe dizziness, trouble breathing.",
        "warnings":"If you are using this medication to treat hives, tell your doctor right away if you have any of these other symptoms because they may be signs of a more serious condition: hives that are an unusual color, hives that look bruised or blistered, hives that do not itch. This drug may make you drowsy."
    },
    "flonase":{
        "other_names":"FLUTICASONE PROPIONATE",
        "use": "Fluticasone is used to relieve seasonal and year-round allergic and non-allergic nasal symptoms, such as stuffy/runny nose, itching, and sneezing. It can also help relieve allergy eye symptoms such as itchy, watery eyes. This medication belongs to a class of drugs known as corticosteroids.",
        "side_effects":"Nasal dryness/irritation, nausea, or vomiting may occur. Tell your doctor right away if you have any serious side effects, including: sore throat that doesn't go away, eye pain, facial pain, signs of nasal damage (such as pain, severe nosebleeds, a constant whistling sound from your nose), white patches in your nose/back of your throat, pain when swallowing. Rarely, it is possible that corticosteroids given in the nose will be absorbed into the bloodstream.",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: recent nose problems (such as injury, ulcers, surgery), infections (including tuberculosis, herpes eye infection), certain eye problems (glaucoma, cataracts), liver disease."
    },
    "abilify":{
        "other_names":"ARIPIPRAZOLE",
        "use":"Aripiprazole is used to treat certain mental/mood disorders (such as bipolar disorder, schizophrenia, Tourette's syndrome, and irritability associated with autistic disorder). It may also be used in combination with other medication to treat depression. Aripiprazole is known as an antipsychotic drug (atypical type). It works by helping to restore the balance of certain natural chemicals in the brain (neurotransmitters).This medication can decrease hallucinations and improve your concentration. It helps you to think more clearly and positively about yourself, feel less nervous, and take a more active part in everyday life. Aripiprazole can treat severe mood swings and decrease how often mood swings occur.",
        "side_effects":"Dizziness, lightheadedness, drowsiness, nausea, vomiting, tiredness, excess saliva/drooling, blurred vision, weight gain, constipation, headache, and trouble sleeping may occur. Tell your doctor right away if you have any serious side effects, including: fainting, mental/mood changes (such as increased anxiety, depression, suicidal thoughts), trouble swallowing, restlessness (especially in the legs), shaking (tremor), muscle spasm, mask-like expression of the face, seizures, trouble controlling certain urges (such as gambling, sex, eating or shopping), interrupted breathing during sleep.",
        "warnings":"This drug may make you dizzy or drowsy or blur your vision. This medication may make you sweat less, making you more likely to get heat stroke. Older adults may be more sensitive to the side effects of this drug, especially seizures, drowsiness, dizziness, lightheadedness, confusion, tardive dyskinesia, swallowing problems, and other serious (rarely fatal) side effects. Before using this medication, tell your doctor or pharmacist your medical history, especially of: problems with blood flow in the brain (such as cerebrovascular disease, stroke), diabetes (including family history), heart problems (such as low blood pressure, coronary artery disease, heart failure, irregular heartbeat), nervous system problems (such as dementia, NMS, seizures), obesity, low white blood cell count (including history of low white blood cell count caused by medications), swallowing problems, breathing trouble during sleep (sleep apnea)."
    },
    "actos":{
        "other_names":"PIOGLITAZONE",
        "use":"Pioglitazone is a diabetes drug (thiazolidinedione-type, also called glitazones) used along with a proper diet and exercise program to control high blood sugar in patients with type 2 diabetes. It works by helping to restore your body's proper response to insulin, thereby lowering your blood sugar.",
        "side_effects":"Sore throat, muscle pain, weight gain, or tooth problems may occur. Tell your doctor right away if you have any serious side effects, including: new/worsening vision problems (such as blurred vision), bone fracture, reddish-colored urine, urgent need to urinate, pain while urinating. Pioglitazone may rarely cause liver disease. Pioglitazone may, but does not usually cause low blood sugar (hypoglycemia).",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: heart disease (such as congestive heart failure, chest pain), liver disease, fluid in your lungs, swelling (edema), anemia, a certain eye problem (macular edema), bladder cancer. You may experience blurred vision, dizziness, or drowsiness due to extremely low or high blood sugar. Do not drive, use machinery, or do any activity that requires alertness or clear vision until you are sure you can perform such activities safely. It may be harder to control your blood sugar when your body is stressed (such as due to fever, infection, injury, or surgery). Consult your doctor because increased stress may require a change in your treatment plan, medications, or blood sugar testing. Pioglitazone may increase the risk of bone fracture in women (usually in the upper arm, hand, or foot). Pioglitazone can cause changes in the menstrual cycle (promote ovulation) and increase the risk of becoming pregnant."
    },
    "acyclovir":{
        "other_names":"ZOVIRAX",
        "use":"Acyclovir is used to treat infections caused by certain types of viruses. It treats cold sores around the mouth (caused by herpes simplex), shingles (caused by herpes zoster), and chickenpox.This medication is also used to treat outbreaks of genital herpes. In people with frequent outbreaks, acyclovir is used to help reduce the number of future episodes. Acyclovir is an antiviral drug",
        "side_effects":"Nausea, diarrhea, headache, or vomiting may occur. Tell your doctor right away if you have any serious side effects, including: dizziness, drowsiness, signs of kidney problems (such as a change in the amount of urine, unusual back/side pain), mental/mood changes (such as agitation, confusion, hallucinations), shaky/unsteady movement, trouble speaking. This medication may rarely cause a life-threatening disorder that affects the blood cells, kidneys, and other parts of the body. A very serious allergic reaction to this drug is rare.",
        "warnings":""
    },
    "allopurinol":{
        "other_names":"ZYLOPRIM",
        "use":"Allopurinol is used to treat gout and certain types of kidney stones. It is also used to prevent increased uric acid levels in patients receiving cancer chemotherapy. ",
        "side_effects":"Stomach upset, nausea, diarrhea, or drowsiness may occur. Tell your doctor right away if you have any serious side effects, including: numbness/tingling of arms/legs, easy bleeding/bruising, unusual tiredness, signs of kidney problems (such as change in the amount of urine, painful/bloody urination), signs of liver disease (such as nausea/vomiting that doesn't stop, loss of appetite, stomach/abdominal pain, yellowing eyes/skin, dark urine), unusual weight loss, eye pain, vision changes. Allopurinol may rarely cause very serious (possibly fatal) skin reactions. Some people in certain ethnic groups (such as people of African, Asian, or Native Hawaiian/Pacific Islander descent) are at greater risk. ",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: liver disease, kidney disease, diabetes, high blood pressure (hypertension), unusual diets (such as fasting). This drug may make you drowsy. Allopurinol passes into breast milk."
    },
    "ambien":{
        "other_names":"ZOLPIDEM",
        "use":"Zolpidem is used for a short time to treat a certain sleep problem (insomnia) in adults.",
        "side_effects":"Dizziness may occur. This medication may make you sleepy during the day. ",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: kidney disease, liver disease, mental/mood problems (such as depression, thoughts of suicide), personal or family history of a substance use disorder (such as overuse of or addiction to drugs/alcohol), personal or family history of sleepwalking, lung/breathing problems (such as chronic obstructive pulmonary disease-COPD, sleep apnea), a certain muscle disease (myasthenia gravis). The effects of this drug can last even after you wake up the next day. If you did not get 7 to 8 hours of sleep or took other medications that made you sleepy or are more sensitive to this drug, you may feel alert but not think clearly enough to drive. You may also experience dizziness or blurred/double vision. Alcohol or marijuana (cannabis) can make you more dizzy. Wait at least 8 hours after taking this drug before driving, and do not drive, use machinery, or do anything that needs alertness until you can do it safely. This medication may also increase the risk of falls. Avoid alcoholic beverages. Children may be more sensitive to the side effects of this drug, especially dizziness and hallucinations."
    },
    "amitriptyline":{
        "other_names":"Elavil",
        "use":"This medication is used to treat mental/mood problems such as depression.",
        "side_effects":"Drowsiness, dizziness, dry mouth, blurred vision, constipation, weight gain, or trouble urinating may occur. Tell your doctor right away if you have any serious side effects, including: heartburn that doesn't go away, easy bleeding/bruising, shaking, mask-like facial expressions, muscle spasms, severe stomach/abdominal pain, decreased sexual ability/desire, enlarged/painful breasts. Get medical help right away if you have any very serious side effects, including: black stools, vomit that looks like coffee grounds, severe dizziness, fainting, seizures, eye pain/swelling/redness, widened pupils, vision changes (such as seeing rainbows around lights at night).This medication may rarely cause a very serious condition called neuroleptic malignant syndrome (NMS). Get medical help right away if you have any of the following symptoms: fever, muscle stiffness, severe confusion, sweating, fast/irregular heartbeat.",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: bleeding problems, breathing problems, liver problems, recent heart attack, problems urinating (such as due to enlarged prostate), overactive thyroid (hyperthyroidism), personal or family history of glaucoma (angle-closure type), personal or family history of mental/mood conditions (such as bipolar disorder, psychosis), family history of suicide, seizures, conditions that may increase your risk of seizures (such as other brain disease, alcohol withdrawal). Amitriptyline may cause a condition that affects the heart rhythm (QT prolongation). QT prolongation can rarely cause serious (rarely fatal) fast/irregular heartbeat and other symptoms (such as severe dizziness, fainting) that need medical attention right away. The risk of QT prolongation may be increased if you have certain medical conditions or are taking other drugs that may cause QT prolongation. Before using amitriptyline, tell your doctor or pharmacist of all the drugs you take and if you have any of the following conditions: certain heart problems (heart failure, slow heartbeat, QT prolongation in the EKG), family history of certain heart problems (QT prolongation in the EKG, sudden cardiac death). This drug may make you dizzy or drowsy or blur your vision."
    },
    "amoxicillin":{
        "other_names":"Moxatag",
        "use":"Amoxicillin is used to treat a wide variety of bacterial infections. This medication is a penicillin-type antibiotic. ",
        "side_effects":"Nausea, vomiting, or diarrhea may occur. Use of this medication for prolonged or repeated periods may result in oral thrush or a new vaginal yeast infection (oral or vaginal fungal infection). Tell your doctor right away if you have any serious side effects, including: signs of liver disease (such as nausea/vomiting that doesn't stop, loss of appetite, stomach/abdominal pain, yellowing eyes/skin, dark urine), easy bruising or bleeding. This medication may rarely cause a severe intestinal condition due to a bacteria called C. difficile. Amoxicillin can commonly cause a mild rash that is usually not serious. ",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: kidney disease, a certain type of viral infection (infectious mononucleosis). Amoxicillin may cause live bacterial vaccines (such as typhoid vaccine) to not work well. Tell your health care professional that you are using amoxicillin before having any immunizations/vaccinations. Amoxicillin passes into breast milk."
    },
    "atenolol":{
        "other_names":"TENORMIN",
        "use":"Atenolol is used with or without other medications to treat high blood pressure (hypertension).",
        "side_effects":"Dizziness, lightheadedness, tiredness, and nausea may occur. This drug may reduce blood flow to your hands and feet, causing them to feel cold.",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: certain types of heart rhythm problems (such as slow heartbeat, second- or third-degree atrioventricular block), breathing problems (such as asthma, chronic bronchitis, emphysema), blood circulation problems (such as Raynaud's disease, peripheral vascular disease), kidney disease, heart failure, serious allergic reactions including those needing treatment with epinephrine, a certain muscle disease (myasthenia gravis). This drug may make you dizzy. If you have diabetes, this product may mask the fast/pounding heartbeat you would usually feel when your blood sugar falls too low (hypoglycemia).Children may be at greater risk for low blood sugar (hypoglycemia), especially if they are vomiting or not eating regularly. "
    },
    "ativan":{
        "other_names":"LORAZEPAM",
        "use":"This medication is used to treat anxiety. Lorazepam belongs to a class of drugs known as benzodiazepines which act on the brain and nerves (central nervous system) to produce a calming effect.",
        "side_effects":"Drowsiness, dizziness, loss of coordination, headache, nausea, blurred vision, change in sexual interest/ability, constipation, heartburn, or change in appetite may occur. Tell your doctor right away if you have any unlikely but serious side effects, including: mental/mood changes (such as hallucinations, depression, thoughts of suicide), trouble speaking, vision changes, unusual weakness, trouble walking, memory problems, signs of infection (such as sore throat that doesn't go away, fever). Get medical help right away if you have any rare but very serious side effects, including: yellowing eyes or skin, seizures, slow/shallow breathing. This medication can rarely have the opposite of its usual calming effect. Symptoms of this opposite effect may include agitation, irritability, violent behavior, confusion, restlessness, excitement, and talking more than normal. ",
        "warnings":"Before using this medication, tell your doctor or pharmacist your medical history, especially of: kidney disease, liver disease, glaucoma, lung/breathing problems (such as sleep apnea), mental/mood disorders (such as depression, psychosis), personal or family history of a substance use disorder (such as overuse of or addiction to drugs/alcohol). This drug may make you dizzy or drowsy or blur your vision. Older adults may be more sensitive to the side effects of this drug, especially loss of coordination and drowsiness. Loss of coordination and drowsiness may increase the risk of falling. This drug may have the opposite of its usual calming effect in children, causing restlessness, shaking, or mental/mood changes (such as agitation, hallucinations). This drug passes into breast milk. You should not become pregnant while using lorazepam. Lorazepam may harm an unborn baby. Newborn babies of mothers who use this medication late in pregnancy may have symptoms such as slow/shallow breathing, nonstop crying, shaking, or trouble feeding. "
    },
    "aspirin":{
        "other_names":"",
        "use":"Aspirin is used to reduce fever and relieve mild to moderate pain from conditions such as muscle aches, toothaches, common cold, and headaches. It may also be used to reduce pain and swelling in conditions such as arthritis. Aspirin is known as a salicylate and a nonsteroidal anti-inflammatory drug (NSAID).",
        "side_effects":"Upset stomach and heartburn may occur. Tell your doctor right away if you have any serious side effects, including: nausea/vomiting that is severe or doesn't stop, easy bruising/bleeding, difficulty hearing, ringing in the ears, signs of kidney problems (such as change in the amount of urine), unexplained tiredness, dizziness, dark urine, yellowing eyes/skin. This drug may rarely cause serious bleeding from the stomach/intestine or other areas of the body.",
        "warnings":"If you have any of the following health problems, consult your doctor or pharmacist before using this medication: bleeding/blood-clotting disorders (such as hemophilia, vitamin K deficiency, low platelet count), kidney disease, liver disease, diabetes, stomach problems (such as ulcers, heartburn, stomach pain), aspirin-sensitive asthma (a history of worsening breathing with runny/stuffy nose after taking aspirin or other NSAIDs), growths in the nose (nasal polyps), gout, certain enzyme deficiencies (pyruvate kinase or G6PD deficiency). This medicine may cause stomach bleeding. Children and teenagers less than 18 years old should not take aspirin if they have chickenpox, flu, or any undiagnosed illness or if they have recently received a vaccine. In these cases, taking aspirin increases the risk of Reye's syndrome, a rare but serious illness.Older adults may be more sensitive to the side effects of this drug, especially stomach/intestinal bleeding and ulcers. Aspirin is not recommended for use to treat pain or fever during pregnancy. Aspirin passes into breast milk."
    },
    "name":{
        "other_names":"",
        "use":"",
        "side_effects":"",
        "warnings":""
    }
}